Revit 2027 API
LineProperties.Color Property
 The current color used when drawing lines/curves.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color Color { get; }
Public ReadOnly Property Color As Color
	Get
public:
property Color^ Color {
	Color^ get ();
}
member Color : Color with get
Property Value
Color
See Also
Reference
LineProperties Class
Autodesk.Revit.DB Namespace